var data_travel = {
    type: "sunburst",
    ids: [
        "觀光景點排行", "2019", "2020", "2021", 
        "觀光團體", 
        "觀光團體 - 夜市" , "觀光團體 - 故宮博物院", "觀光團體 - 台北101", "觀光團體 - 日月潭", 
        "非觀光團體", 
        "非觀光團體 - 夜市", "非觀光團體 - 台北101" , "非觀光團體 - 西門町", "非觀光團體 - 九份",
        "2020 - 1-3月",
        "2020 - 1-3月 - 夜市", "2020 - 1-3月 - 台北101" , "2020 - 1-3月 - 西門町", "2020 - 1-3月 - 九份",
        "2020 - 7-12月",
        "2020 - 7-12月 - 夜市", "2020 - 7-12月 - 台北101" , "2020 - 7-12月 - 西門町", "2020 - 7-12月 - 淡水",
        "2021 - 1-6月",
        "2021 - 1-6月 - 夜市", "2021 - 1-6月 - 台北101" , "2021 - 1-6月 - 西門町", "2021 - 1-6月 - 淡水",
        "2021 - 7-12月",
        "2021 - 7-12月 - 夜市", "2021 - 7-12月 - 台北101" , "2021 - 7-12月 - 西門町", "2021 - 7-12月 - 淡水"
    ],
    values: [
        , 0, 0, 0, 
        0, 
        1456, 1253, 1223, 1143, 
        0, 
        5378, 3252, 3127, 2491,
        0, 
        1522, 820, 810, 709,
        0, 
        784, 292, 181, 114,
        0,
        880, 312, 245, 228,
        0, 
        326, 94, 72, 78
    ],
    labels: [
        "觀光景點排行", "2019", "2020", "2021", 
        "觀光團體", 
        "夜市" , "故宮博物院", "台北101", "日月潭",
        "非觀光團體", 
        "夜市", "台北101", "西門町", "九份",
        "上半年(1-3月 4-6月實施疫情邊境管制 無資料)", 
        "夜市", " 台北101" , "西門町", "九份",
        "下半年(7-12月)",
        "夜市", "台北101" , "西門町", "淡水",
        "上半年(1-6月)", 
        "夜市", " 台北101" , "西門町", "淡水",
        "下半年(7-12月)",
        "夜市", "台北101" , "西門町", "淡水"
    ],
    parents: [
        "", "觀光景點排行", "觀光景點排行", "觀光景點排行", 
        "2019", 
        "觀光團體", "觀光團體" , "觀光團體", "觀光團體",
        "2019", 
        "非觀光團體", "非觀光團體", "非觀光團體", "非觀光團體",
        "2020", 
        "2020 - 1-3月", "2020 - 1-3月", "2020 - 1-3月", "2020 - 1-3月", 
        "2020",
        "2020 - 7-12月", "2020 - 7-12月", "2020 - 7-12月", "2020 - 7-12月",
        "2021", 
        "2021 - 1-6月", "2021 - 1-6月", "2021 - 1-6月", "2021 - 1-6月", 
        "2021", 
        "2021 - 7-12月", "2021 - 7-12月", "2021 - 7-12月", "2021 - 7-12月"
    ],
    outsidetextfont: {size: 20, color: "#377eb8"},
    // leaf: {opacity: 0.4},
    marker: {line: {width: 2}},
  };
  
  
  var layout_travel = {
    margin: {l: 0, r: 0, b: 0, t:0},
    sunburstcolorway:["#637E76","#FAEED1","#DED0B6"],
  };
  
  data_travel_all = [data_travel];

  Plotly.newPlot("no1_graph", data_travel_all, layout_travel);  